---
type: PaperSourceSet
namespace: Autodesk.Revit.DB
version: 2024
members: 10
tags: [revit-api, class]
---

# PaperSourceSet

`Autodesk.Revit.DB.PaperSourceSet` · Revit 2024 · 10 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | PaperSourceSet | — | `public PaperSourceSet ()` |
| Method | Clear | — | `public virtual void Clear ()` |
| Method | Contains | — | `public virtual bool Contains ( PaperSource item )` |
| Method | Erase | — | `public virtual int Erase ( PaperSource item )` |
| Method | ForwardIterator | — | `public virtual PaperSourceSetIterator ForwardIterator ()` |
| Method | GetEnumerator | — | `public virtual IEnumerator GetEnumerator ()` |
| Method | Insert | — | `public virtual bool Insert ( PaperSource item )` |
| Method | ReverseIterator | — | `public virtual PaperSourceSetIterator ReverseIterator ()` |
| Property | IsEmpty | — | `public virtual bool IsEmpty { get ; }` |
| Property | Size | — | `public virtual int Size { get ; }` |